2_lids_driven_flow/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWallTop
    {
        type            zeroGradient; //this means the gradient of the pressure is 0 at the wall
                                      //means the value is assumed to be constant at the wall?

    }

    movingWallBottom
    {
      type              zeroGradient;
    }


    fixedWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty; //empty means you ignore the solutions for this bit, used for 2D sims.
    }
}

// ************************************************************************* //
